; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v6)
             (pred_11 ?v10 ?v12)
             (pred_12 ?v13 ?v12)
             (pred_5 ?v4 ?v13 )
	     (pred_7 ?v13)
             (pred_2 ?v1)
             (pred_3 ?v10)
             (pred_4 ?v12)
             (pred_8 ?v13)
             (pred_10 ?v10)
             (pred_6 ?v13)
             (pred_9 ))



(:action op_3
:parameters (?v9 ?v3 ?v8 ?v2)
:precondition (and (pred_2 ?v9) (pred_2 ?v3) (pred_3 ?v8) (pred_4 ?v2)
          (pred_1 ?v9 ?v3) (pred_11 ?v8 ?v2)
                   (pred_12 ?v3 ?v2) (pred_7 ?v9) 
                   (pred_8 ?v3) (pred_10 ?v8))
:effect (and  (pred_6 ?v3) (not (pred_8 ?v3))))


(:action op_1
:parameters (?v9 ?v11)
:precondition (and (pred_2 ?v9) (pred_2 ?v11)
               (pred_7 ?v9) (pred_1 ?v9 ?v11) (pred_6 ?v11))
:effect (and (pred_7 ?v11) (not (pred_7 ?v9))))

(:action op_4
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_3 ?v8) 
                  (pred_7 ?v9) (pred_5 ?v8 ?v9) (pred_9 ))
:effect (and (pred_10 ?v8)
   (not (pred_5 ?v8 ?v9)) (not (pred_9 ))))


(:action op_5
:parameters (?v9 ?v5 ?v7)
:precondition (and (pred_2 ?v9) (pred_3 ?v5) (pred_3 ?v7)
                  (pred_7 ?v9) (pred_10 ?v7) (pred_5 ?v5 ?v9))
:effect (and (pred_10 ?v5) (pred_5 ?v7 ?v9)
        (not (pred_10 ?v7)) (not (pred_5 ?v5 ?v9))))

(:action op_2
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_3 ?v8) 
                  (pred_7 ?v9) (pred_10 ?v8))
:effect (and (pred_9 ) (pred_5 ?v8 ?v9) (not (pred_10 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_20 obj_04 obj_18 obj_16 obj_07 obj_19 obj_08 obj_27 obj_13 obj_31 obj_21 obj_23 obj_28 obj_22 obj_29 obj_09 obj_06 obj_24 obj_12 obj_10 obj_17 obj_32 obj_01 obj_03 obj_25
    obj_30 obj_26 obj_11
    obj_02 obj_15 obj_05 obj_14
    )

    (:init
       (pred_9)

       (pred_2 obj_20)
       (pred_2 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_16)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_2 obj_08)
       (pred_2 obj_27)
       (pred_2 obj_13)
       (pred_2 obj_31)
       (pred_2 obj_21)
       (pred_2 obj_23)
       (pred_2 obj_28)
       (pred_2 obj_22)
       (pred_2 obj_29)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_24)
       (pred_2 obj_12)
       (pred_2 obj_10)
       (pred_2 obj_17)
       (pred_2 obj_32)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_25)
       (pred_4 obj_30)
       (pred_4 obj_26)
       (pred_4 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_14)

       (pred_1 obj_20 obj_19)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_04 obj_18)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_18 obj_27)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_18 obj_04)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_07 obj_31)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_08 obj_23)
       (pred_1 obj_08 obj_27)
       (pred_1 obj_08 obj_04)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_27 obj_28)
       (pred_1 obj_27 obj_13)
       (pred_1 obj_27 obj_18)
       (pred_1 obj_27 obj_08)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_31)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_27)
       (pred_1 obj_31 obj_29)
       (pred_1 obj_31 obj_07)
       (pred_1 obj_31 obj_13)
       (pred_1 obj_21 obj_09)
       (pred_1 obj_21 obj_23)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_23 obj_06)
       (pred_1 obj_23 obj_28)
       (pred_1 obj_23 obj_08)
       (pred_1 obj_23 obj_21)
       (pred_1 obj_28 obj_24)
       (pred_1 obj_28 obj_22)
       (pred_1 obj_28 obj_27)
       (pred_1 obj_28 obj_23)
       (pred_1 obj_22 obj_12)
       (pred_1 obj_22 obj_29)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_28)
       (pred_1 obj_29 obj_10)
       (pred_1 obj_29 obj_31)
       (pred_1 obj_29 obj_22)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_21)
       (pred_1 obj_06 obj_32)
       (pred_1 obj_06 obj_24)
       (pred_1 obj_06 obj_23)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_24 obj_12)
       (pred_1 obj_24 obj_28)
       (pred_1 obj_24 obj_06)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_12 obj_10)
       (pred_1 obj_12 obj_22)
       (pred_1 obj_12 obj_24)
       (pred_1 obj_10 obj_25)
       (pred_1 obj_10 obj_29)
       (pred_1 obj_10 obj_12)
       (pred_1 obj_17 obj_32)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_32 obj_01)
       (pred_1 obj_32 obj_06)
       (pred_1 obj_32 obj_17)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_32)
       (pred_1 obj_03 obj_25)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_25 obj_10)
       (pred_1 obj_25 obj_03)
       (pred_8 obj_31)
       (pred_8 obj_10)
       (pred_8 obj_06)
       (pred_8 obj_28)
       (pred_12  obj_31 obj_30)
       (pred_12  obj_10 obj_26)
       (pred_12  obj_06 obj_11)
       (pred_12  obj_28 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_27)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_23)
       (pred_6 obj_22)
       (pred_6 obj_29)
       (pred_6 obj_09)
       (pred_6 obj_24)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_32)
       (pred_6 obj_01)
       (pred_6 obj_03)
       (pred_6 obj_25)

       (pred_11  obj_02 obj_30)
       (pred_11  obj_15 obj_26)
       (pred_11  obj_05 obj_11)
       (pred_11  obj_14 obj_11)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_05 obj_31)
       (pred_5 obj_14 obj_12)
       (pred_7 obj_12)
    )

    (:goal (and
       (pred_5 obj_14 obj_18)
    ))
(:constraints
  (always (not (pred_7 obj_22)))
)
)

; plan
1. (op_4 obj_12 obj_14)
   deleted: (pred_5 obj_14 obj_12) (pred_9)
   added: (pred_10 obj_14)
   goals met: 0 of 1
2. (op_1 obj_12 obj_24)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_24)
   goals met: 0 of 1
3. (op_3 obj_24 obj_28 obj_14 obj_11)
   deleted: (pred_8 obj_28)
   added: (pred_6 obj_28)
   goals met: 0 of 1
4. (op_1 obj_24 obj_28)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_28)
   goals met: 0 of 1
5. (op_1 obj_28 obj_27)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_27)
   goals met: 0 of 1
6. (op_1 obj_27 obj_18)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_18)
   goals met: 0 of 1
7. (op_2 obj_18 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_9) (pred_5 obj_14 obj_18)
   goals met: 1 of 1
